{
  "url": "https://fahrplan.events.ccc.de/camp/2019/Fahrplan/events/10257.html",
  "id": 10257,
  "guid": "65d27021-12c5-4e4c-8cfd-20c50ec9795a",
  "logo": null,
  "date": "2019-08-24T21:00:00+02:00",
  "start": "21:00",
  "duration": "00:45",
  "room": "Curie",
  "slug": "Camp2019-10257-little_big_data",
  "title": "Little Big Data",
  "subtitle": "Spurensuche in elektronischen Teilnehmerverzeichnissen",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "de",
  "abstract": "Ein Geheimdienst im 21. Jahrhundert, der was auf sich hält, muss Big Data machen: Möglichst alles über alle Bürger sammeln, horten, sortieren, filtern, rastern und ja niemandem was von den Ergebnissen mitteilen. Da haben wir uns gedacht: Das können wir auch! Daher machen wir für unseren eigenen Kurznachrichtendienst eben in Little Big Data.",
  "description": "Praktischerweise stellt die Deutsche Telekom im Halbjahrestakt eine digitale Offlinedatenbank bereit, die schonmal Adressen, Telefonnummern und Geokoordinaten der meisten Einwohner enthält - und das seit 1992. Einzige Nachlässigkeit: Die Informationen sind in binärer Form auf den Datenträgern abgelegt und die Gewissenhaftigkeit der Informanten im Post- und Telekomdienst lässt ausweislich offensichtlicher Fehler in den Datensätzen zu wünschen übrig.\r\n\r\nBegleitet uns in einem besinnlichen Diavortrag bei Geschichten einer abenteuerlichen Jagd nach den Datensätzen, von nervenaufreibendem Starren auf Binärmuster, um den Geheimnissen der Encraption auf den Grund zu gehen und dem überwältigenden Gefühl, mal an Datenmengen zu schnuppern, die noch vor ein paar Jahren problemlos als “Big Data” durchgegangen wären.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 1544,
      "public_name": "erdgeist"
    },
    {
      "id": 1645,
      "public_name": "Andreas Lehner"
    }
  ],
  "links": [],
  "attachments": []
}