{
    "url": "https://fahrplan.events.ccc.de/camp/2019/Fahrplan/events/10208.html",
    "id": 10208,
    "guid": "7926f5ba-d424-4523-890b-08736b08a9b9",
    "logo": "/system/events/logos/000/010/208/large/KRITIS_Sektoren.jpeg?1563712264",
    "date": "2019-08-23T22:00:00+02:00",
    "start": "22:00",
    "duration": "00:45",
    "room": "Curie",
    "slug": "Camp2019-10208-defensive_statt_offensive_am_beispiel_von_kritis",
    "title": "#Defensive statt #Offensive am Beispiel von KRITIS",
    "subtitle": "aka Ethik rekalibrieren",
    "track": "Ethics, Society & Politics",
    "type": "lecture",
    "language": "de",
    "abstract": "Es wird in einer aktuellen Übersicht aufgezeigt, dass die Cybersicherheitsstrategie in Deutschland keine Strategie darstellt. Darüber Hinaus wird aufgezeigt, welche Gesetzesvorhaben die Sicherheit schwächen oder bereits geschwächt haben und was das für Auswirkungen auf kritische Infrastrukturen (KRITIS) - und somit auf uns als Gesamtbevölkerung - haben kann. Zuletzt werden mögliche Optionen als Forderungen aufgezeigt, durch die sich das aktuelle Lagebild bessern kann.",
    "description": "Neun Sektoren wurden in den ersten zwei Körben des IT-Sicherheitsgesetz als kritische Infrastrukturen definiert. Darunter fallen Energieversorgung, Finanz- und Versicherungswesen,\r\nWasser, Ernährung, Gesundheit, IT und TK, Transport und Verkehr. Deren durch IT-Störungen bedingter Versorgungsausfall kann zu einem Großlagebild oder sogar zu einer Krise führen, in der eine Versorgung eines großen Teils der Bevölkerung nicht mehr gewährleistet werden könnte. Wie riskiert der Staat durch eine offensive Cyberwar Vorgehensweise und hybride Kriegsführung dazu, diese Risiken zu erhöhen und warum trifft uns das als Bevölkerung ganz konkret und spielt sich nicht nur im Internet ab? Wie kann es zu physischen IT-Störungen und Ausfällen kommen und was müsste man als Forderungen dagegen vornehmen, um von einer offensiven zu einer defensiven Vorgehensweise zurück zu kommen. Und wieso liegt darin die einzig wahre Lösung für die Bevölkerung?",
    "recording_license": "",
    "do_not_record": false,
    "persons": [
        {
            "id": 1294,
            "public_name": "HonkHase"
        }
    ],
    "links": [
        {
            "url": "https://www.blablasecurity.de/",
            "title": "Folien zu bereits gehaltenen KRITIS und Ethik Vorträgen"
        },
        {
            "url": "https://www.blablasecurity.de/20190601_Berlinsides_HonkHase.pdf",
            "title": "Zum Zeitpunkt der Einreichung aktuellster Foliensatz zum Thema"
        }
    ],
    "attachments": [
        {
            "url": "/attachments/original/missing.png",
            "title": "file"
        }
    ]
}