{
  "id": 111,
  "guid": "93312758-6925-5e84-85b5-3b80f92a0faa",
  "logo": "/media/thms/images/P9JCSV/Im_Eis_Ronja_Reese.png",
  "date": "2019-08-24T17:00:00+02:00",
  "start": "17:00",
  "duration": "01:00",
  "room": "Plank",
  "slug": "P9JCSV",
  "url": "http://talx.thm.cloud/thms/talk/P9JCSV/",
  "title": "Global Warming Sucks!",
  "subtitle": "",
  "track": "Talk",
  "type": "Talk",
  "language": "de",
  "abstract": "Alle reden vom Klimawandel, doch niemand erklärt was da gerade passiert. Wird es in Zukunft einfach nur schön warm oder wird die Veränderung der Umwelt die Menschheit in die Knie zwingen? Warum der Temperaturanstieg der Atmosphäre einzigartig ist und welche Folgen dies für Land, Meer und Gletscher hat, erklärt die angehende Polarforscherin Maria-Elena Vorrath.",
  "description": "Die Diskussion über den menschengemachten Klimawandel ist in den Medien stark verzerrt und es ist schwer sich als Laie in der Informationsflut zu orientieren. Der Vortrag \"Global Warming Sucks!\" soll eine breiten Zuhörerschaft über die aktuelle Situation des sich wandelnden Erdklimas sachlich aufklären. Es wird erklärt, wie der Ausstoß von Treibhausgasen die Atmosphäre seit der Industrialisierung beeinflusst und auf die bisherigen beobachteten Veränderungen in allen Teilen der Erde eingegangen. Anschließend werden einige globale Kipppunkte, die sensiblen Bausteine des Klimasystems, vorgestellt, und ihre Reichweite, Verwundbarkeit und Bedeutung für die Menschheit verdeutlicht. Angesichts der wissenschaftlichen Erkenntnisse können die Zuschauer nun öffentliche Auseinandersetzungen besser einordnen und kommentieren und ihren Beitrag zur Lösung der Klimakrise bestimmen. Fragen sind ausdrücklich erwünscht.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 22,
      "code": "7JYRX9",
      "public_name": "Maria-Elena Vorrath",
      "biography": "Ich lebe in Bremerhaven und promoviere am Alfred Wegener Institut über die Geschichte des Antarktischen Meereises und Klimas. Unsere Forschung leistet einen Beitrag um Klimaveränderungen der Vergangenheit zu erforschen und diese Erkenntnisse für Klimaprojektionen der Zukunft zu nutzen. Ansonsten mache ich viele Science Slams und Wissenschaftskommunikation.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}