{
  "url": "https://fahrplan.events.ccc.de/camp/2019/Fahrplan/events/10231.html",
  "id": 10231,
  "guid": "94273ff5-ae50-49bd-a892-5a5f2e8c8451",
  "logo": null,
  "date": "2019-08-24T14:00:00+02:00",
  "start": "14:00",
  "duration": "00:45",
  "room": "Curie",
  "slug": "Camp2019-10231-ethikrichtlinien_fur_kunstliche_intelligenz_wie_war_s_mit_gesetzen",
  "title": "Ethikrichtlinien für Künstliche Intelligenz? Wie wär's mit Gesetzen?",
  "subtitle": "Wie die Industrie mit Debatten um \"ethische KI\" Zeit kauft",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "de",
  "abstract": "Bisweilen kann man sich des Eindrucks nicht erwehren, jede zweite Woche würde eine neue, wachsweiche Selbstverpflichtung für den ethischen Einsatz von Algorithmen bekanntgegeben. Privatwirtschaftliche wie öffentliche Organisationen übertrumpfen sich geradezu dabei zu betonen, dass der Mensch bei allen maschinellen Entscheidungen im Mittelpunkt stehen soll und dass diese transparent sein müssen. Aber was bringt einem das Wissen um benachteiligende oder falsche Funktionsweise der Algorithmen, wenn man sie dennoch nicht verbieten kann? Und: sollten wir die Regeln für den zukünftigen Einsatz von Maschinen wirklich von den Konzernen gestalten lassen, die diese Technologien entwickeln? \r\n\r\nWir zeigen, wie wenig konkret die verschiedenen Selbstverpflichtungen der Unternehmen, Verbände und Organisationen sind und wie all das Reden über Ethik  in den meisten Fällen einem Ziel dient: gesetzliche Regulierung verhindern.",
  "description": "Bisweilen kann man sich des Eindrucks nicht erwehren, jede zweite Woche würde eine neue, wachsweiche Selbstverpflichtung oder Empfehlung für den ethischen Einsatz von Algorithmen bekanntgegeben. Privatwirtschaftliche wie öffentliche Organisationen übertrumpfen sich geradezu dabei, ein weiteres Mal zu betonen, dass der Mensch bei allen maschinellen Entscheidungen im Mittelpunkt stehen soll, dass sie fair und nachvollziehbar sein müssen und es stets die Möglichkeit zum Widerspruch gegen eine solche Entscheidung geben muss. Transparenz, Transparenz und nochmals Transparenz sei das Maß aller Dinge. Aber was heißt das konkret für diejenigen, die nur noch per Gesichtserkennung in ihr Büro oder Wohnung reinkommen, deren Kredit, Wohnungs- oder Arbeitsgesuch abgelehnt wird oder sie vom Jobcenter keine Förderung bekommen dank einem Algorithmus? Was bringt einem das Wissen um benachteiligende oder falsche Funktionsweise der Algorithmen, wenn man sie dennoch nicht verbieten kann? Welchen Sinn hat das Recht darauf, sich a posteriori wehren zu dürfen, wenn man bereits alles verloren hat? Und: sollten wir die Regeln für den zukünftigen Einsatz von Maschinen wirklich von den Konzernen gestalten lassen, die diese Technologien entwickeln? Ethikforscher, die sich für Selbstregulierung einsetzen, verschweigen oft, dass ihre Einrichtungen von Techfirmen finanziert werden. Selbst die neuen Ethischen Richtlinien der EU sind von Google, IBM, Facebook und Zalando mitgeschrieben worden.\r\n\r\nWir zeigen, wie wenig konkret die verschiedenen Selbstverpflichtungen der Unternehmen, Verbände und Organisationen sind und wie all das Reden über Ethik  in den meisten Fällen einem Ziel dient: gesetzliche Regulierung verhindern.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 8967,
      "public_name": "Chris Köver"
    }
  ],
  "links": [],
  "attachments": []
}