{
    "url": "https://fahrplan.events.ccc.de/camp/2019/Fahrplan/events/10349.html",
    "id": 10349,
    "guid": "95a8ea24-a2dd-479f-86fd-6e96ce66a47e",
    "logo": null,
    "date": "2019-08-23T16:00:00+02:00",
    "start": "16:00",
    "duration": "00:45",
    "room": "Meitner",
    "slug": "Camp2019-10349-it-sicherheit_in_vernetzten_gebauden",
    "title": "IT-Sicherheit in vernetzten Gebäuden",
    "subtitle": "Was kann man noch retten, wenn langlebigen Strukturen grundlegende Sicherheitskonzepte fehlen?",
    "track": "Security",
    "type": "lecture",
    "language": "de",
    "abstract": "Ein automatisiertes Gebäude ist schön, komfortabel und praktisch. Doch das wäre nicht Thema für einen Vortrag beim CCCamp, wenn es nicht einige gravierende Schwachstellen in den Bussystemen gäbe. Der Vortrag bietet eine Einführung in die Funktionalität von vernetzten Gebäuden am Beispiel des KNX Standards. Ohne dass ihr großes Vorwissen benötigt, berichte ich euch von Sicherheitsproblemen und möglichen Lösungsansätzen zur nachträglichen Steigerung der Sicherheit solcher Gebäudeautomatisierungssysteme.",
    "description": "Feldbusse wie KNX werden in modernen Gebäuden eingesetzt, um typische Vorteile der Gebäudeautomation zu erzielen. Man verspricht sich Komfortgewinn, Kosteneinsparungen und Flexibilität. Klassische Schutzziele wurden beim Design dieser Bussysteme hintenangestellt und IT-Sicherheit so sträflich missachtet. Funktionalitäten wie Verschlüsselung oder Authentifikation der Kommunikationsteilnehmer sucht man bisweilen vergeblich. Sind die Gebäude erst einmal gebaut, wird die installierte Infrastruktur über Jahrzehnte betrieben. Das Licht des Kollegen im Nachbarbüro zu schalten ist ebenso leicht, wie das Steuern einer an den Feldbus angebundenen Heizung. Was im Büro noch verhältnismäßig harmlos erscheint, wird bedrohlich, wenn man bedenkt, dass auch Kraftwerke und andere kritische Infrastrukturen ähnliche Systeme nutzen.\r\n\r\nNach einer Einführung in den KNX Bus geht der Vortrag auf Schwachstellen und deren mögliche Folgen in automatisierten Gebäuden ein. Es wird gezeigt, dass sich aus scheinbar harmlosen Sensoraktivitätsdaten bereits intime, personenbezogene Informationen herausarbeiten lassen.\r\n\r\nUm die Sicherheit bereits installierter, langlebiger Gebäudeinfrastrukturen dennoch zu erhöhen, werden bereits bekannte Verfahren aus der IP-Welt auf Feldbusse übertragen. Netzwerksegmentierung, IDS und Filterung sind erste Ansätze, auf die der Vortrag eingeht. Es werden deren Möglichkeiten und Grenzen beschrieben.\r\n\r\n Darüber hinaus wird ein entwickelter Testdatensatz zur Evaluierung solcher und anderer Ansätze vorgestellt.",
    "recording_license": "",
    "do_not_record": false,
    "persons": [
        {
            "id": 9060,
            "public_name": "Simeon"
        }
    ],
    "links": [],
    "attachments": []
}