{
  "url": "https://fahrplan.events.ccc.de/camp/2019/Fahrplan/events/10202.html",
  "id": 10202,
  "guid": "c1146d2e-c4cf-44ed-8d83-3fe3c3a4ba0e",
  "logo": null,
  "date": "2019-08-24T17:00:00+02:00",
  "start": "17:00",
  "duration": "00:45",
  "room": "Meitner",
  "slug": "Camp2019-10202-wisdom_of_os",
  "title": "Wisdom of OS",
  "subtitle": "An Inquiry into the Limits of the Possible",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "de",
  "abstract": "Klimakrise, Artensterben, die Grundlagen des Leben – unsere Herausforderungen sind dringend, global und komplex. Seit dem Anthropozän wissen wir, dass der Planet in unserer Hand liegt. Jetzt müssen wir unsere Köpfe zusammenstecken und gemeinsam Lösungen entwickeln. Anknüpfend an historischen Konzepte von einer das Weltwissen allgemein zugänglich machenden World Encyclopedia und des künstlich intelligenten Word Brain kann eine interdisziplinäre Betrachtung durch unterschiedliche Herangehensweisen spannende neue Sichtweisen eröffnen.\r\n\r\nDie Wahrnehmung von Betriebssystemen als Schnittstelle zwischen Mensch und Maschine, die Auswirkung von Softwarelizenzen auf die Gestaltung der Verhältnisse zwischen Maschinen, Menschen, Firmen und Staaten und die mit einer weltweiten Vernetzung entstehenden Chancen und Risiken können aus Hackersicht von einem sehr technischen Startpunkt analysiert werden.\r\n\r\nDas Anthropzän verlangt den Übergang in die Noosphäre. Und das heißt, wir müssen das  Urheberrecht als juristisches Betriebssystem unserer Wissensordnung in Ordnung bringen, das Netz als seine technische Infrastruktur redezentralisieren und semantifizieren, unser wissenschaftliches, journalistisches und künstlerisches Sensorium stärken und Werkzeuge entwickeln, die es uns erlauben, gemeinsam zu denken und zu enstscheiden. Mehr als künstliche brauchen wir menschliche kollektive Intelligenz, um die Betriebssysteme unserer Gesellschaft mit kollektiver Weisheit auszustatten.",
  "description": "",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 5580,
      "public_name": "vgrass"
    },
    {
      "id": 1545,
      "public_name": "ruedi"
    }
  ],
  "links": [
    {
      "url": "http://public.beuth-hochschule.de/~rweis/papers/WeisHochschulforumDigitalisihttp://public.beuth-hochschule.de/~rweis/papers/WeisHochschulforumDigitalisierungBetriebssystemBildung.pdferungBetriebssystemBildung.pdf",
      "title": "Rüdiger Weis, Bildung als Betriebssystem der Digitalen Gesellschaft, HRK Expertenanhörung, Frankfurt, 7. Februar 2019 "
    }
  ],
  "attachments": [
    {
      "url": "/system/event_attachments/attachments/000/003/763/original/WeisHochschulforumDigitalisierungBetriebssystemBildung.pdf?1560249921",
      "title": "Rüdiger Weis, Bildung als Betriebssystem der Digitalen Gesellschaft, HRK Expertenanhörung, Frankfurt, 7. Februar 2019 "
    }
  ]
}