{
  "id": 150,
  "guid": "c26d6ec7-2701-56dc-8110-9896c6f6a659",
  "logo": "",
  "date": "2019-08-22T18:15:00+02:00",
  "start": "18:15",
  "duration": "01:00",
  "room": "Plank (Stage)",
  "slug": "GRRQTX",
  "url": "http://talx.thm.cloud/thms/talk/GRRQTX/",
  "title": "Als Netzaktivistin im Bundestag – Insider Einblicke und Mitmachmöglichkeiten",
  "subtitle": "",
  "track": "Talk",
  "type": "Talk",
  "language": "de",
  "abstract": "Der Bundestag ist anders als man denkt. Analoger als man ohnehin\r\nvermutet, mit irrsinnigen Abläufen und unvorstellbaren Papierbergen. Es\r\nist viel anstrengender, als man sich je hätte ausmalen können. Man hat\r\nzu viel Durst und zu wenig Schlaf und kaum noch ein Privatleben. Aber\r\nman kann einen Unterschied machen und deshalb will ich zeigen, dass\r\nPolitik auch kompetent, transparent und partizipativ möglich ist. In\r\ndieser Session gebe ich Insider Einblicke in den Alltag als netzpolitische Sprecherin der Linksfraktion im Bundestag,\r\nzeige die Handlungsmöglichkeiten einer Oppositionspolitikerin und wie\r\nIhr als Netzcommunity mich als Eure Volksvertreterin nutzen könnt, um\r\nz.B. auf offiziellen Kanälen Informationen abzufragen, an die man sonst\r\nnicht kommt, denn Wissen ist Macht.",
  "description": "Die Arbeit einer Bundestagsabgeordneten hatte ich mir anders\r\nvorgestellt. Schon rein vom praktischen Alltag her. Mich überraschten\r\nTrinkverbote, 17-stündige Plenartage ohne Pausen, Schreibmaschinen,\r\nKarteikarten und Faxgeräte, ich verlief mich in unterirdischen\r\nLabyrinthen, fing 19 Mäuse im Büro und freute mich, als 2018 endlich das\r\nWLAN kam. Ich wurde netzpolitische Sprecherin der Linksfraktion, Mitglied bzw. stellvertretendes Mitglied im\r\nDigitalausschuss, im Beirat der Bundesnetzagentur (Megathema 5G\r\nLizenzversteigerung), der Enquete Kommission Künstliche Intelligenz, in\r\nden Ausschüssen für Bildung/Forschung/Technikfolgen sowie für Verkehr\r\nund digitale Infrastruktur. In 22 Monaten hielt ich 19 Reden, stellte 43\r\nschriftliche Fragen, 33 Kleine Anfragen, 5 Anträge und reichte einen\r\neigenen Gesetzentwurf ein. Es ging um Überwachung am Südkreuz, Open\r\nSource, das NetzDG, Hackbacks, IPv6, Künstliche Intelligenz, DNA\r\nAnalysen in der Stammbaumforschung, Uploadfilter, IT Sicherheit,\r\nImpressumpflichten, barrierefreie Notrufe, Whistleblower, Mobilfunk,\r\nOpen Data, KfZ Scanning, Funkzellenabfragen und stille SMS, digitale\r\nGewalt gegen Frauen, Bundeswehr bei re:publica, Verschlüsselung,\r\nLobbyregister, social Innovation und vieles mehr. Auf parlamentarischen\r\nReisen im Ausland lernte ich, wie weit das links regierte Uruguay in der\r\ndigitalen Bildung ist, wie man in Oman durch kluge Regulierung die\r\nFunklöcher auf dem Land los wurde und wie viele Lichtjahre wir vom\r\neGovernment in Dänemark entfernt sind. Seit 10 Jahren setze ich mich für\r\ntransparente und partizipative Politik ein. Jetzt will ich meine eigenen\r\nAnsprüche daran auch erfüllen. Ich berichte vor allem auf Twitter und\r\nInstagram live aus Ausschüssen, Anhörungen und von Parlamentarierreisen\r\nund greife Anregungen auf, die mich auf irgendeinem Kanal erreichen. Ich\r\nverstehe mich als Volksvertreterin im Wortsinn und möchte als\r\nNetzaktivistin ganz besonders Sprachrohr der Netzcommunity sein. Als\r\nPolitikerin einer Oppositionspartei kann ich Themen setzen und\r\nInformationen beschaffen, ich kann fiese Fragen stellen – in langen und\r\nkurzen Formaten und die Bundesregierung muss darauf antworten. In dieser\r\nSession werde ich Beispiele zeigen, über meine Pläne reden und Euch\r\nfragen, was Ihr schon immer von der Bundesregierung in Netzfragen wissen\r\nwollten, damit ich die GroKo weiter nerven kann und wir alle besser\r\nwissen, was sie tun.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 58,
      "code": "VJGNQC",
      "public_name": "Anke Domscheit-Berg",
      "biography": "Als Quereinsteigerin mit netzpolitischer Expertise kam ich im Oktober 2017 als parteilose Abgeordnete der Linksfraktion in den Bundestag, nachdem ich 15 Jahre in der IT Industrie und -Beratung und seit 2011 freiberuflich als Publizistin v.a. zu den Schwerpunkten Digitale Gesellschaft und Geschlechtergerechtigkeit gearbeitet hatte und seit langem als Netzaktivistin engagiert war. Ich möchte die politische Ebene dafür nutzen, eine linke Vision für eine digitale Gesellschaft zu entwickeln und stark zu machen, denn eine digitale Revolution braucht auch eine soziale Revolution. Ich lebe im Norden von Brandenburg, wo ich mit meinem Mann Daniel und anderen Mitstreiter*innen den havel:lab e.V. gegründet habe, der Träger für den \"Verstehbahnhof\" wurde, ein Makerspace und Bildungsort für Kinder- und Jugendliche mit dem Schwerpunkt Digitales. Im Internet findet man mich unter anderem auf Twitter (@anked) und bei instagram (@adomscheitberg) und unter www.ankedomscheitberg.de.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}