{
  "id": 109,
  "guid": "c59b2363-a6cb-561a-84e5-2e55a759ef97",
  "logo": "",
  "date": "2019-08-24T00:00:00+00:00",
  "start": "00:00",
  "duration": "02:00",
  "room": "Plank",
  "slug": "QWFLJN",
  "url": "http://talx.thm.cloud/thms/talk/QWFLJN/",
  "title": "Drum&Bass",
  "subtitle": "",
  "track": "Music",
  "type": "DJ Set",
  "language": "en",
  "abstract": "Barbara Wimmer tritt unter dem Namen Shroombab seit 1998 als Drum&Bass-DJ auf. Sie hat in 28 Ländern der Welt und mehr als 600 Clubs und auf zahlreichen Festivals gespielt.Zudem hat sie Veröffentlichungen auf mehr als zehn Labels - von ihrem Heimatland Österreich, bis hin zu UK, DE und den USA.",
  "description": "Shroombab, DJ, producer and founder of High Tension Recordings, is a fixed “institution” of Austrias drum&bass-scene. She was born in Upper Austria and moved to Vienna in 1997 – where she started to change her instruments from flute & guitar to turntables & sequencers. Successfully: Gigs in over 28 countries all over the world and several record releases on quality labels followed.\r\n\r\nShroombabs efforts to create her own music and get perfect at spinning records were strong. But not enough, she combined creativity with her talent to organize things: She set up her own Drum’n’Bass clubnight called “Bass Land” (with MC Terra), her own label “High Tension Recordings” and founded the “Junglistic Sistaz” – first a successful girls duo with MC Terra, later a database for women in drum&bass, which got a quality reference for female DJs especially in Eastern Europe.\r\n\r\nApart from numerous national DJ bookings at the best and most established clubs all over Austria, Shroombab got a residency at D.Kay & Raw.fulls weekly clubnight \"Beat It\" at the famous Flex in Vienna which is running since 2004. Her international DJ-gigs brought her to places like Cape Town, Johannesburg, Moscow, St. Petersburg, Talin, Seattle, Paris, London, Barcelona, Berlin, Bukarest, Bratislava and many more cities and festival. \r\n\r\nHer favorite producers are Calyx, Matrix, Ed Rush & Optical, Teebee, Break, Benny Page, Deekline, Ils, Aquasky, DZ, High Rankin, Skream, Marlow.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 20,
      "code": "QRJVAP",
      "public_name": "Barbara",
      "biography": "Barbara Wimmer tritt unter dem Namen Shroombab seit 1998 als Drum&Bass-DJ auf. Sie hat in 28 Ländern der Welt und mehr als 600 Clubs und auf zahlreichen Festivals gespielt.Zudem hat sie Veröffentlichungen auf mehr als zehn Labels - von ihrem Heimatland Österreich, bis hin zu UK, DE und den USA.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}