{
  "url": "https://fahrplan.events.ccc.de/camp/2019/Fahrplan/events/10377.html",
  "id": 10377,
  "guid": "e1cba2cc-d83f-44dc-869e-51fdfc628563",
  "logo": null,
  "date": "2019-08-24T12:00:00+02:00",
  "start": "12:00",
  "duration": "00:45",
  "room": "Meitner",
  "slug": "Camp2019-10377-solare_brennstoffe_-_wasserstoff_aus_sonnenlicht",
  "title": "Solare Brennstoffe - Wasserstoff aus Sonnenlicht",
  "subtitle": "Solarzellen können nicht nur Strom erzeugen",
  "track": "Science",
  "type": "lecture",
  "language": "de",
  "abstract": "Sonnenenergie deckt heute erst etwas über 2% des weltweiten Energiebedarfs durch Umwandlung von Sonnenlicht in elektrische Energie. Eine der Möglichkeiten, um diese zu speichern, ist die Elektrolyse von Wasser, um Wasserstoff zu erhalten.\r\nWas aber wäre, wenn man Wasserstoff direkt gewinnen könnte?\r\n\r\nEine schnelle Übersicht über Sonnenlicht, das Prinzip hinter Photovoltaischen Solarzeiien, und wie photoelektrochemische Zellen, die flüssiges Wasser in seine Bestandteile Wasserstoff und Sauerstoff spalten können, beide Prozesse miteinander kombinieren können.",
  "description": "Die von uns Menschen verantworteten CO2-Emissionen müssen reduziert werden, aber wie? \r\nDie Erzeugung von elektrischer Energie aus Sonnenlicht wird mit großer Sicherheit einen signifikanten Beitrag zur Deckung des weltweiten Energiebedarfs liefern. \r\nZuerst sehen wir uns das Spektrum der Sonne an, und wie viel dieser Energie wo auf der Erde ankommt.\r\nWenn dieses Licht auf Atome trifft, wie die Siliziumatome in einer Solarzelle, kann es diese in einen energiereicheren Zustand anregen, aber nur ein Teil des Sonnenlichts hat genug Energie, um diese Anregung zu erreichen. Was für Konsequenzen hat das für die Effizienz von Photovoltaik-Zellen?\r\nJeder kennt die blau-schillernde Silizium Photovoltaikzelle, die Größen von wenigen Quadratzentimeter in einem Taschenrechner über Installationen auf Hausdächern mit einigen Kilowatt bis zu Solarparks, die mehrere Megawatt Spitzenleistung abgeben können.\r\nSolarenergie ist vom Tag-Nacht-Zyklus der Erde und von der Jahreszeit abhängig. Um die Energieversorgung auch z.B. im Winter bei geringerer Sonnenintensität decken zu können, muss diese längerfristig gespeichert werden. Verschiedene Strategien sind denkbar, eine davon die Umwandlung in chemische Energie in Form von Wasserstoff durch Elektrolyse von Wasser.\r\nBeide Technologien bringen Umwandlungsverluste mit sich und erfordern teilweise teure Metalle und viel Energie bei der Herstellung.\r\n\r\nAber es gibt eine Klasse an Halbleiter-Materialien, die, wenn man sie in Wasser eintaucht und mit Sonnenlicht bestrahlt, die Lichtenergie direkt auf das Wasser übertragen, und es in Wasserstoff und Sauerstoff spalten können. Man umgeht die Kopplung von Photovoltaik und Elektrolyse.\r\nViele dieser halbleitenden Materialien sind mit weit weniger Energieaufwand herzustellen als Silizium. Besondere Aufmerksamkeit ist auf häufig vorkommende und damit gut verfügbare Metalle gerichtet. Eisenoxid - Rost, oder Titandioxid - das Pigent aus weißer Wandfarbe, sind zwei Beispiele, die jeder kennt, ihre Superpower aber sehr warscheinlich nicht.\r\nNoch sind die Wirkungsgrade gering und marktreife Lösungen noch nicht absehbar. Wenn der Ansatz allerdings erfolgreich ist, könnte dies ein Durchbruch für unsere Energieerzeugung sein, und nebenbei einen Teil des Problems lösen, Energie zu speichern und zu transportieren. ",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9097,
      "public_name": "Stormwind"
    }
  ],
  "links": [],
  "attachments": []
}