{
  "url": "https://fahrplan.events.ccc.de/camp/2019/Fahrplan/events/10346.html",
  "id": 10346,
  "guid": "e9010267-d885-4982-92ff-4341dff3d5ea",
  "logo": "/system/events/logos/000/010/346/large/equilibrist-1831016_640.png?1560294050",
  "date": "2019-08-23T20:00:00+02:00",
  "start": "20:00",
  "duration": "00:45",
  "room": "Meitner",
  "slug": "Camp2019-10346-was_tun_gegen_digitale_gewalt_gegen_frauen",
  "title": "Was tun gegen Digitale Gewalt gegen Frauen",
  "subtitle": "\"Nicht dem Phänomen Cybercrime im engeren Sinne zuzuordnen\" (Aus einer Antwort der Bundesregierung)",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "de",
  "abstract": "Digitale Gewalt ist mehr als Hatespeech: Dazu gehören Doxing, Identitätsdiebstahl, Bildmanipulationen und deren Veröffentlichung, Spy Apps und noch mehr. Das meiste davon ist verboten, gilt aber nicht als 'Cybercrime'. Der Talk beschreibt, was dazu gehört, wer betroffen ist, was sich bei dem Thema seit den Doxing-Fällen im Januar getan hat und was nötig wäre, um langfristig etwas zu ändern. ",
  "description": "Auf die Frage, ob Digitale Gewalt gegen Frauen auch ‚Cybercrime‘ sei, antwortete die Bundesregierung Ende November 2018: „Da es sich bei digitaler Gewalt nicht um Straftaten handelt, die sich gegen das Internet, Datennetze, informationstechnische Systeme oder deren Daten richten, sind sie nicht dem Phänomen Cybercrime im engeren Sinne zuzuordnen.“\r\n\r\nWenige Wochen später drehte sich der Wind, als Anfang Januar bekannt wurde, dass 1000 Prominente gedoxt* worden waren, darunter viele Bundestagsabgeordnete. Mit diesem Fall wurde ein Vorgehen zum schwerwiegenden IT-Sicherheitsproblem, von dem vorher schon viele andere Menschen betroffen waren, ohne dass ein Hahn danach krähte.\r\n\r\nIn diesem Talk wird im ersten Teil der aktuelle Stand der Erkenntnisse zu den verschiedenen Phänomen erläutert, die unter den Sammelbegriff Digitale Gewalt gegen Frauen fallen: Beleidigungen, Bedrohungen, Erpressung mit der Drohung, intime Bilder zu veröffentlichen oder das Veröffentlichen solcher Bilder - auch bekannt als ‚Revenge Porn‘ - , geheime Ton-/Bild-/Videoaufnahmen und die Weitergabe an Dritte, Online-Stalking, das Installieren von Spy-Apps, Identitätsdiebstahl und -missbrauch, Doxing, Manipulation und Veröffentlichung von Bildern bspw. zusammen mit der Wohnadresse usw. usf. \r\n\r\nDas alles ist verboten, aber aus verschiedenen Gründen ist es oft schwierig, sich dagegen zu wehren. \r\n\r\nDeswegen geht es im zweiten Teil darum, dass und wobei Betroffene zu wenig Unterstützung bekommen: praktisch, juristisch, durch Polizei und Politik. Das beginnt oft bei der Frage der Zuständigkeit. Unter Cybercrime wird in der Regel kriminelles Verhalten gegenüber Geräten, Unternehmen oder Infrastrukturen verstanden, jedenfalls nach Auffassung deutscher Innenpolitiker. Dazu kommen Fälle, bei denen es ums Geld geht und natürlich auch Kinderpornographie. \r\n\r\nInnenminister Seehofer hat im Januar verkündet, dass das neue IT-Sicherheitsgesetz die Probleme lösen soll, die zu den Doxingfällen des „Adventskalenders“ geführt haben. Auf dem Tisch liegen Vorschläge für mehr Überwachung, weniger Verschlüsselung und mehr Geld für die Sicherheitsbehörden. Immerhin: Das BSI soll sich mehr um Verbraucherschutz kümmern. So wie es aussieht, ist die digitale Seite der häuslichen Gewalt aber wieder nicht dabei – dafür ist ja das Familien- und Frauenministerium zuständig. \r\n\r\nBetroffene von Doxing, Revenge Porn, ferngesteuerten ‚Smart Devices‘ oder Spy Apps haben es meist schwer, kompetente Ansprechpartner*innen bei Polizei und Justiz zu finden. Es gibt auch kaum Beratungsstellen für diese Fälle, obwohl die Folgen manchmal schwerwiegend sind. \r\n\r\nDeswegen gibt es im dritten Teil konkrete Tips für Betroffene und Hinweise, wo derzeit Lücken bestehen und Vorschläge, wie die geschlossen werden können\r\n\r\nVielleicht - hoffentlich - ergibt sich im Anschluss an den Talk die Gelegenheit darüber zu sprechen, wie in manchem Fällen ganz praktisch Abhilfe geschaffen werden kann. \r\n\r\n\r\n*Doxing bezeichnet das Veröffentlichen privater Daten oder Informationen (= Dokumente, ‚Docs‘) im Netz\r\n\r\nImage by <a href=\"https://pixabay.com/users/ElisaRiva-1348268/?utm_source=link-attribution&amp;utm_medium=referral&amp;utm_campaign=image&amp;utm_content=1831016\">ElisaRiva</a> from <a href=\"https://pixabay.com/?utm_source=link-attribution&amp;utm_medium=referral&amp;utm_campaign=image&amp;utm_content=1831016\">Pixabay</a>",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 1864,
      "public_name": "Anne Roth"
    }
  ],
  "links": [
    {
      "url": "https://www.spiegel.de/thema/digitale_gewalt_gegen_frauen/",
      "title": "Themenschwerpunkt Digitale Gewalt bei Spiegel Online"
    },
    {
      "url": "https://dipbt.bundestag.de/extrakt/ba/WP19/2414/241403.html",
      "title": "Kleine Anfrage 'Digitale Gewalt gegen Frauen', Nov. 2018"
    },
    {
      "url": "https://www.aktiv-gegen-digitale-gewalt.de/de/",
      "title": "Hilfeseiten des \"Bundesverbandes Frauenberatungsstellen und Frauennotrufe\"  "
    }
  ],
  "attachments": []
}