{
  "id": 142,
  "guid": "ecc2fea1-4e7c-5dce-a88c-e808dd245271",
  "logo": "",
  "date": "2019-08-21T17:00:00+02:00",
  "start": "17:00",
  "duration": "01:00",
  "room": "Plank",
  "slug": "ET9CFU",
  "url": "http://talx.thm.cloud/thms/talk/ET9CFU/",
  "title": "Konviviale Software vor und jenseits des digitalen Kapitalismus",
  "subtitle": "",
  "track": "Talk",
  "type": "Talk",
  "language": "de",
  "abstract": "Der Vortrag geht der Frage nach, welche Aspekte der Geschichte des digitalen Wandels mit der Bestrebung nach einer sozial-ökologischen Gestaltung von Technik zu tun haben. Dabei wird gezeigt, was die Nachhaltigkeitsbewegung von der Free-Software-Bewegung und der Hacker-Ethik lernen kann, insbesondere bzgl. der Autonomie gegenüber digitalen Großkonzernen durch Selbstverwaltung und kollaborative Entwicklung. Andersherum wird diskutiert, was die Techszene über die Notwendigkeit und Möglichkeiten einer sozial-ökologischen Transformation lernen kann. Im Grunde genommen geht es hier darum, die emanzipatorischen Elemente der digitalen Technikentwicklung (die vor dem digitalen Kapitalismus des 21. Jahrhunderts existierten und sich ihm weiterhin entgegenstellen) und die Botschaften der politischen Ökologie in eine gemeinsame Erzählung zusammenzuführen.",
  "description": "Der Begriff \"Konvivialität\" wurde in der politischen Ökologie eingeführt, um eine Vorstellung von Technik zu beschreiben, die sich von der industriellen Produktivität unterscheidet. Dabei geht es darum, Technik auf der Grundlage sozial-ökologischer Kriterien zu bewerten. Diese Kriterien werden vorgestellt und auf den Bereich digitale Technik angewandt. Ein Überblick über die Geschichte der Softwareentwicklung und des digitalen Kapitalismus wird zeigen, dass Konvivialität viel mit FOSS-Prinzipien zu tun hat, im Gegensatz zu kommerzieller Software, die von Konzernen entwickelt wird. Die Analyse anhand von Konvivialitätskriterien wird dadurch zur nützlichen Methode, um über digitale Technik zu reflektieren. Perspektivisch könnte das zu einer Annäherung der kritischen Tech- und Ökologiebewegungen führen: die etablierte Praxis der Free-Software-Bewegung könnte zu einer Keimform einer sozial-ökologischen Utopie jenseits des digitalen Kapitalismus werden.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 44,
      "code": "BMHR3B",
      "public_name": "Nicolas",
      "biography": "Nicolas ist promovierter Informatiker, der die Wissenschaft hinter sich gelassen hat, um sich auf zivilgesellschaftlicher Seite für einen emanzipatorischen Umgang mit digitalen Technologien einzusetzen. Er arbeitet beim Konzeptwerk Neue Ökonomie zu Digitalisierung und ist in der Klimagerechtigkeitsbewegung aktiv.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}