{
  "url": "https://fahrplan.events.ccc.de/camp/2019/Abfahrplan/events/10415.html",
  "id": 10415,
  "guid": "ed456981-5e9b-4305-9d53-2235bd49e259",
  "logo": "/system/events/logos/000/010/415/large/barbnerdy.jpg?1566146674",
  "date": "2019-08-23T01:00:00+02:00",
  "start": "01:00",
  "duration": "02:00",
  "room": "Kemistry Lounge",
  "slug": "camp19lounge-10415-barbnerdy",
  "title": "BarbNerdy",
  "subtitle": "",
  "track": "Music",
  "type": "djset",
  "language": "en",
  "abstract": "My philosophy: Sharing means caring – knowledge is growing when its shared.",
  "description": "I started DJ'ing in 1990 in Munich with Garage House, NY Style, changed later to Chicago House and ended up with Detroit Techno (1994) but decided to play “Freestyle” very early (1996) as I got bored of playing the same kind of music all night long. In the 90ies I played a lot of gigs all over Europe along all the big names at this time. Even Tony Humphries, Jeff Mills, Colin Faver, DJ Hell. In Clubs like Tresor Berlin, E-Werk Berlin, Museum of Modern Art in Copenhagen, Flex inVienna, Raves in Italy, small and big Festivals and many many more. \r\n1997 I moved to Hamburg where I started a monthyl club night called Club Neu at Club Tempelhof. There we played a really cool freestyle programm, from Hip-Hop to Djungle, from Electro via Disco to House or Beatz. And the crowd there was really cool. They danced to everything we \"served\". \r\nI also organized there a really cool night with Cheap Records from Vienna meets Clear Records (Matthew Herbert) or the huge DJ Hell at Rote Flora event. Somtimes I had a chance to play the famour Pudel Club which was also big fun!\r\nIn 1999 I moved to Berlin where I started \"Support Your Local Ghetto\" which was the name of my weekly Radio Show on Twen.FM a pirate radio here in Berlin. I had a lot of fun playing my fave tunes plus having guests from all over the world. Mostly my guests where just from the neighborhood. I love my hood. There are so many talented artists which have to be heard. So, lets stay local. But local not only in the meaning of territory, local means also all the friends and people you have in your neighborhood. Will never forget the outstanding show with Blake Baxter and Abe Duque or with the Stones Throw Dudes. Some recordings of this shows must still be in the interwebs. Will try to find and publish them here.\r\nIn 2011 I reactived the \"support your local ghetto\" This time at the lovely Panke in Berlin Wedding as a monthly club night. Every last friday of the month. This event I did for 3 years until April 2014.\r\nWork in Music:\r\nI started working in the music – biz also very early - in the very early 90ies in Munich where I started the booking agency around the Label Disko B and the Club Ultraschall. (Artists: DJ Hell, Blake Baxter, Abe Duque, Patrick Pulsinger and many more).\r\n\r\nIn ’96 a major label called and I moved to Hamburg to promote great artists like: Goldie, Roni Size, Money Mark, Portishead etc… Parallel I had a weekly residency at Club Tempelhof, where I played my “Freestyle” program. Of course way too early, so after 1 year it was done. After my experience with a Major Label I did some freelance jobs till the next milestone in my live started: Press Speaker Assistant of the Loveparade ’99 in Berlin. I moved to Berlin, worked for the Sonar Kollektiv (Label collective of Jazzanova) until a friend of mine hired me to help him setting up the Software Startup go_Disko*. I was really happy there but one day I received a mail from iTunes, where they offered me the Job as “Head of Editorial” for the German iTunes store. I started working there right after they opened in Germany – in a team of 2 people – for the next 3,5 years. Great Time it was!\r\nAfter this great experience I was totally focussed on the topic “future of things.. ” and changed after some nice little jobs for BPitch Control, Puppetmastaz etc..from the music biz to the online biz. Cause at this time (and most is still) every cool new thing was / is forbidden by law in Germany. I organized the re:publica 09 (started 6 weeks before and put all strings together) and now I’m an Online Project Manager, have my 2 own blogs, still do DJing and diggin music. I’m very curious about new strategies, recommendation systems, apps and have a dream of an aggregated platform with something like a semantic search, where you can find everything about your fave artist, movie etc.. Where you can listen for free, pay for a download or even pay per stream. All in one platform. Since 2 years I’m a paying Spotify customer. Started in Sept. 2007 using Soundcloud for my DJ mixes. All my 23 Mixes where played 15.000 times, downloaded 3.100 times in 107 countries since than. I dig music all through the internet, get recommendations from my social network, share my findings and pay wherever I can pay. I’m a very proud owner of 15.000 Vinyls and have around 160 GB well sorted music on my hard drive.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [],
  "links": [
    {
      "url": "https://soundcloud.com/barbnerdy/",
      "title": "BarbNerdy on Soundcloud"
    }
  ],
  "attachments": []
}