{
  "url": "https://fahrplan.events.ccc.de/camp/2019/Fahrplan/events/10344.html",
  "id": 10344,
  "guid": "ed4b6c75-14f4-49fe-a11e-3762bd6b54e3",
  "logo": "/system/events/logos/000/010/344/large/dsgvo-pannen-show-logo-quadrat.jpg?1560288198",
  "date": "2019-08-22T23:00:00+02:00",
  "start": "23:00",
  "duration": "01:30",
  "room": "Meitner",
  "slug": "Camp2019-10344-achtung_datenpannen",
  "title": "Achtung, Datenpannen!",
  "subtitle": "Die große Datenschutz- und DSGVO-Show",
  "track": "Entertainment",
  "type": "lecture",
  "language": "de",
  "abstract": "<p>Eine Mischung aus einem Vortrag und einer Spiel- und Lernshow rund um die Datenschutz-Grundverordnung, die spielerisch Wissenswertes rund um Datenschutz und die Datenschutz-Grundverordnung vermittelt – anhand von tatsächlichen Beratungsanfragen und Datenpannen-Meldungen, die tagtäglich bei den Aufsichtsbehörden eingehen. Im Stil der Spielshow „Der Große Preis“ stehen Kandidaten Rede und Antwort zu skurrilen Fällen und heiß diskutierten Problemen rund um Datenschutz, technischen Maßnahmen und die DS-GVO.</p>\r\n",
  "description": "<p>Bei Diskussionen über Datenschutz kommen technische Maßnahmen aus dem Bereich der IT-Sicherheit bisher oftmals viel zu kurz. Dabei können fehlende oder falsch implementierte Maßnahmen Sanktionen der Aufsichtsbehörden nach sich ziehen.</p>\r\n<p>Die große <strong>Datenschutz- und DSGVO-Show</strong> vermittelt auf spielerische Weise rechtliche, technische und praktische Hilfe rund um Datenschutz und die EU-Datenschutz-Grundverordnung. </p>\r\n<ul>\r\n<li>Welche Verschlüsselungs-Verfahren muss ein Datenverarbeiter verwenden, um kein Bußgeld zu riskieren?</li>\r\n<li>Erfüllt ein verschlüsselter ZIP-Anhang in einer E-Mail die Anforderungen der DS-GVO auf „Sicherheit der Verarbeitung“?</li>\r\n<li>Oder die „bisher ungeknackte Vollbitverschlüsselung“?</li>\r\n<li>Ist ein Messenger-Dienst „sicher“, wenn er Telefonnummern als SHA-256-Hash speichert?</li>\r\n<li>Muss ein Online-Shop wirklich alle Kunden informieren, wenn „ein Hacker“ erfolgreich „nur die E-Mail-Adressen der Kunden“ kopiert hat?</li>\r\n<li>Und was ist mit Google Analytics oder Facebook-Plugins auf Websites?</li>\r\n<li>Welche Rechte hat ein Betroffener gegenüber Datenkraken?</li>\r\n</ul>\r\n\r\n<p>Die Moderatoren sind der <em>Landesbeauftragte für den Datenschutz und die Informationsfreiheit Baden-Württemberg</em> Stefan Brink und zwei Referenten und berichten aus der praktischen Arbeit einer Aufsichtsbehörde. Vor und während dem eigentlichen Quiz geben sie eine kurze Einführung über häufige Datenpannen-Meldungen, rechtliche Grundlagen, Hinweise zu technischen Maßnahmen nach Artikel 32 DS-GVO und die oftmals schwierige Risikoabschätzung.</p>\r\n\r\n<p>Im Quiz selbst müssen die Kandidaten in ihren Antworten praktische Lösungsvorschläge für häufige technische und rechtliche Probleme vorschlagen, zum Beispiel welche technischen Maßnahmen bei bestimmten Datenpannen nach dem „Stand der Technik“ angebracht sind, ob man als Website-Betreiber denn nun Google Analytics nutzen darf oder wie man sich gegen rechtswidrige Datensammler wehrt. Dadurch können Teilnehmer wie Zuschauer die praktische Anwendung der DS-GVO spielerisch lernen.</p>\r\n",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 4555,
      "public_name": "Alvar C.H. Freude"
    },
    {
      "id": 9127,
      "public_name": "Stefan Brink"
    }
  ],
  "links": [
    {
      "url": "https://www.baden-wuerttemberg.datenschutz.de",
      "title": "LfDI Baden-Württemberg"
    },
    {
      "url": "https://www.baden-wuerttemberg.datenschutz.de/wp-content/uploads/2019/04/FAQ-zu-Cookies-und-Tracking.pdf",
      "title": "FAQ zu Cookies und Tracking "
    },
    {
      "url": "https://www.baden-wuerttemberg.datenschutz.de/wp-content/uploads/2019/02/Hinweise-zum-Umgang-mit-Passwoertern-1.0.1.pdf",
      "title": "Hinweise zum sicheren Umgang mit Passwörtern"
    }
  ],
  "attachments": []
}