{
  "id": 149,
  "guid": "eda75c8d-fe02-5986-a6c3-d0b699231b6a",
  "logo": "",
  "date": "2019-08-21T21:10:00+02:00",
  "start": "21:10",
  "duration": "00:30",
  "room": "Plank (Stage)",
  "slug": "NWNHJ3",
  "url": "http://talx.thm.cloud/thms/talk/NWNHJ3/",
  "title": "Über die Nachhaltigkeit von Software",
  "subtitle": "",
  "track": "Talk",
  "type": "Short Talk",
  "language": "de",
  "abstract": "Software ist essenzieller Bestandteil und Ressource unserer Dienstleistungs-\r\nund Wissensgesellschaft sowie unserer Infrastrukturen. Als Ressource\r\nbetrachtet verhält sich der Konsum und Erhalt von Software jedoch in vielen\r\nDingen konträr zu natürlichen Ressourcen. Eine Reflektion über die besonderen\r\nEigenschaften der \"Ressource Software\" und wie wir diese nutzen können um\r\nSoftware nachhaltig zu gestalten und damit auch für die Zukunft zu erhalten.",
  "description": "Wenig wird bisher über digitale Nachhaltigkeit geredet, aber noch weniger über\r\nnachhaltige Software. Dabei ist Software essenzieller Bestandteil und\r\nRessource unserer Dienstleistungs- und Wissensgesellschaften sowie unserer\r\nInfrastrukturen. Kein Telefon, keine Ampel und keine moderne Verwaltung würden\r\nnoch ohne Software funktionieren. Möchten wir diese Systeme erhalten, müssen\r\nwir folglich auch Verfügbarkeit und Zugang zu diesen Ressourcen garantieren.\r\n\r\nWas im Zeitalter von copy&paste und der prinzipiell unbegrenzten Menge\r\ndigitaler Rohstoffe zunächst einfach klingt wird schnell komplex. Durch Recht,\r\nTechnik und Architektur werden Verfügbarkeit und Menge von Software häufig\r\nkünstlich verknappt. Das birgt die Gefahr zu realen Versorgungsengpässen bis\r\nhin zu kompletten Ressourcenverlusten und widerspricht damit dem von den\r\nVereinten Nationen formulierten Ziel einer nachhaltigen Entwicklung und\r\n\"Generationengerechtigkeit\". Und auch wenn sich Software immer\r\nweiterentwickelt und Ressourcen von heute vielleicht schon morgen nicht länger\r\nfür nötig gehalten werden, können als Folge von Abhängigkeiten in komplexen\r\nSystemen schnell Domino-Effekte entstehen.\r\n\r\nDer Vortrag erörtert wie und wo sich nachhaltiges Wirtschaften und Konsum von\r\nSoftware in vielen Dingen konträr zum nachhaltigen Konsum natürlicher\r\nRessourcen verhält. Und wie wir diese uns diese besonderen Eigenschaften\r\nzunutze machen können um Software nachhaltig zu gestalten und damit auch für\r\ndie Zukunft zu erhalten",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 53,
      "code": "USVRGR",
      "public_name": "Erik Albers",
      "biography": "",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}